{
  "patterns": [
    {
      "source": "pair_dieter_lange",
      "principles": {
        "hook_strategy": "Extrahiere die philosophisch provokanteste Aussage aus dem Longform-Content und stelle sie als absolutes Statement an den Anfang, unabhängig davon, wo sie im Original erscheint. Die Aussage muss stark genug sein, um ohne Kontext zu funktionieren und eine 'Wie kann das sein?'-Reaktion auszulösen. Priorisiere Aussagen, die Core-Beliefs herausfordern über Aussagen, die nur interessant sind.",
        "pacing": "Eliminiere jede Pause zwischen Gedanken. Der Clip sollte sich anfühlen wie ein einziger, ununterbrochener Gedankenfluss. Schneide nicht auf 'natürliche' Pausen, sondern auf maximales Momentum. Jeder Satz sollte den nächsten unvermeidlich machen. Die Geschwindigkeit sollte dem Zuschauer nicht erlauben, mental auszusteigen - er muss mitgerissen werden. Aber: Opfere niemals Verständlichkeit für Geschwindigkeit.",
        "structure": "Folge der Struktur: Provokante These → Minimales Story-Setup → Story-Progression → Implizite Lektion. Die These erzeugt Spannung, die Story löst sie auf. Schneide alles Setup, das nicht absolut notwendig ist, um die Story zu verstehen. Die Lektion sollte nie explizit ausgesprochen werden müssen - sie sollte sich aus der Story ergeben. Wenn du die Moral erklären musst, war die Story nicht stark genug."
      }
    },
    {
      "source": "pair_fradrich_lebenslinie",
      "principles": {
        "hook_strategy": "Nutze die dichteste philosophische Abstraktion als Hook, auch wenn sie im Longform mitten im Gedanken steht. Die Frage ist nicht 'Wo beginnt der Speaker?' sondern 'Wo beginnt die Idee in ihrer komprimiertesten Form?'",
        "pacing": "Pacing folgt der kognitiven Verarbeitungsgeschwindigkeit: Gib gerade genug Zeit um das Konzept zu greifen, dann springe zum nächsten Beat bevor Langeweile entsteht. Die Geschwindigkeit sollte sich leicht unbequem anfühlen - das ist Engagement.",
        "structure": "Struktur ist nicht linear sondern konzentrisch: Beginne mit der Kern-Metapher, dann expandiere in konzentrischen Kreisen. Jeder Kreis fügt eine Layer hinzu ohne die vorherige zu wiederholen. Denke: Zoom-out, nicht Timeline."
      }
    },
    {
      "source": "pair_chris_surel_metaphor",
      "principles": {
        "hook_strategy": "Extrahiere den Moment höchster konzeptueller Dichte - wo die meiste Bedeutung in den wenigsten Worten komprimiert ist. Priorisiere Metaphern und Analogien über direkte Statements, wenn sie strukturelle Ähnlichkeit zum Kernkonzept haben. Der Hook sollte eine Frage im Kopf des Zuschauers öffnen, die nur durch Weiterschauen beantwortet werden kann.",
        "pacing": "Die Geschwindigkeit sollte der kognitiven Verarbeitungszeit folgen: Gib dem Zuschauer gerade genug Zeit, die Metapher zu verstehen, aber nicht genug, um sie zu hinterfragen. Konkrete Zahlen können schneller präsentiert werden als abstrakte Konzepte. Das 'aber' am Ende beschleunigt das Tempo durch Erwartungsbruch.",
        "structure": "Baue vom Vertrauten zum Neuen: Bekanntes Konzept (Fußball) → Überraschende Verbindung (ist wie Schlafen) → Praktische Konsequenz (konkrete Stundenzahlen) → Offene Frage (aber...). Jede Ebene sollte die vorherige validieren und gleichzeitig erweitern. Die Struktur folgt dem Prinzip der progressiven Konkretisierung."
      }
    },
    {
      "source": "pair_chris_surel_beliefbreaker",
      "principles": {
        "hook_strategy": "Extrahiere den Moment maximaler kognitiver Dissonanz aus dem Longform und stelle ihn an den Anfang. Der Hook sollte eine verbreitete Gewohnheit/Überzeugung der Zielgruppe direkt challengen. Teste: Würde die Zielgruppe reflexartig widersprechen wollen? Dann ist der Hook stark genug.",
        "pacing": "Jeder Satz muss die Story in eine neue Richtung bewegen: Hook (Dissonanz) → Erklärung (Warum ist das so?) → Konsequenz (Was bedeutet das für mich?). Keine Wiederholungen, keine Ausschmückungen. Die Länge ergibt sich aus der minimalen Anzahl von Sätzen, die nötig sind, um die logische Kette zu schließen. Wenn die Story in 30 Sekunden erzählt ist → 30 Sekunden. Wenn sie 90 braucht → 90 Sekunden.",
        "structure": "Folge der 'Dissonanz-Auflösungs-Kurve': (1) Erzeuge maximale Dissonanz im Hook, (2) Baue Spannung durch Erklärung auf ('Warum ist das so?'), (3) Löse auf mit konkreter Konsequenz/Handlung. Die Struktur ist nicht zeitbasiert, sondern emotionsbasiert - jeder Abschnitt dauert so lange, wie nötig, um die emotionale Transition zu vollziehen."
      }
    },
    {
      "source": "pair_robert_lehmann_shock_1",
      "principles": {
        "hook_strategy": "Extrahiere den Moment maximaler kognitiver Dissonanz. Wenn die Story einen Punkt hat wo zwei inkompatible Realitäten kollidieren, beginne DORT. Nicht mit Setup, nicht mit Kontext. Die Verwirrung ist das Feature, nicht der Bug. Je weniger Sinn der Hook macht, desto stärker der Zwang zur Auflösung.",
        "pacing": "Jedes Wort muss entweder Absurdität verstärken oder Information liefern die zur Auflösung führt. Keine Atmung, keine Pausen, keine Füllwörter. Das Pacing folgt der Dringlichkeit der Frage im Kopf des Zuschauers: 'WIE ist das möglich?'. Schneller = dringender = höheres Engagement. Stoppe bevor die Frage beantwortet ist.",
        "structure": "Nicht Anfang-Mitte-Ende, sondern Peak-Erklärung-Cliffhanger. Beginne am emotionalen Höhepunkt (vergammelte Flossen + Kindersocken). Liefere gerade genug Kontext um es glaubwürdig zu machen (Chefin, Aquarium). Stoppe bevor die Auflösung kommt. Die Struktur ist eine Frage die ihre eigene Antwort verspricht aber verweigert."
      }
    },
    {
      "source": "pair_robert_lehmann_shock_2",
      "principles": {
        "hook_strategy": "Extrahiere den Moment höchster kognitiver Dissonanz oder visueller Vorstellbarkeit aus dem Content, unabhängig davon, wo er im Original steht. Der Hook sollte eine Szene oder ein Phänomen sein, das sofort ein mentales Bild erzeugt und eine implizite Frage aufwirft.",
        "pacing": "Die Geschwindigkeit sollte der kognitiven Verarbeitungszeit folgen: Gib dem Zuschauer gerade genug Zeit, das mentale Bild zu konstruieren und die Dissonanz zu spüren, bevor der nächste Beat kommt. Zu schnell = Verwirrung, zu langsam = Langeweile. Die Aufzählung dient hier als rhythmischer Aufbau zur Payoff-Zeile.",
        "structure": "Beginne mit dem stärksten visuell-vorstellbaren Moment, der eine Erwartung aufbaut. Nutze dann minimale Kontextualisierung (die Aufzählung etabliert Universalität), bevor der Payoff die Erwartung bricht. Die Struktur folgt dem Prinzip: Bild → Kontext → Dissonanz, nicht einem festen Template."
      }
    },
    {
      "source": "pair_patric_heizmann_paradox",
      "principles": {
        "hook_strategy": "Extrahiere den Moment höchster kognitiver Dissonanz aus dem Longform. Der Hook sollte nicht die Einleitung sein, sondern der Moment, wo zwei unvereinbare Realitäten aufeinandertreffen. Frage: 'Wo im Content würde jemand sagen: Warte, WAS?!'",
        "pacing": "Die Informationsdichte sollte exponentiell steigen: Einfache Frage → Konkrete Zahl → Überraschender Vergleich → Provokanter Reframe. Jedes Element sollte schneller kommen als das Gehirn die vorherige Information vollständig verarbeiten kann. Das erzeugt einen 'Informations-Sog'.",
        "structure": "Beginne mit dem stärksten Datenpunkt, nicht mit Kontext. Die Struktur folgt dem Prinzip 'Conclusion First': Zeige erst das überraschende Ergebnis, dann (wenn nötig) die Erklärung. Der Clip invertiert die journalistische Pyramide - das Wichtigste kommt zuerst, nicht zuletzt."
      }
    },
    {
      "source": "pair_gereon_jorn_everyday",
      "principles": {
        "hook_strategy": "Wenn der Payoff eine fundamentale Überzeugung zerstört und durch Präzision glaubwürdig ist, funktioniert er als direkter Hook ohne Setup. Die Dissonanz zwischen kultureller Annahme (Salat = gesund) und neuer Information (Salat = Papier) erzeugt sofortige Attention. Regel: Je größer die kognitive Dissonanz, desto weniger Setup wird benötigt.",
        "pacing": "Die Informationsdichte sollte maximal sein, solange jedes Element zur Kernaussage beiträgt. Geografische Details ('Holland/Spanien') verzögern nur, präzise Vergleiche ('ein Blatt', 'DIN A4') verstärken. Das Pacing folgt dem Prinzip: Jedes Wort muss entweder die Glaubwürdigkeit erhöhen oder die Absurdität verschärfen. Alles andere ist Reibung.",
        "structure": "Die Struktur folgt dem Prinzip der sofortigen Dissonanz-Erzeugung: Schockierender Vergleich → (implizite Pause für kognitive Verarbeitung) → Fortsetzung/Vertiefung. Es gibt kein klassisches Setup-Payoff, weil der Payoff selbst als Setup für die tiefere Erklärung dient. Die Struktur ist rekursiv: Jeder Payoff wird zum Setup für den nächsten Layer."
      }
    },
    {
      "source": "pair_cw_beziehung_paradox",
      "principles": {
        "hook_strategy": "Extrahiere die Meta-Ebene des Problems als Hook, nicht das erste Symptom. Der stärkste Hook ist oft die Zusammenfassung, die der Sprecher mittendrin oder am Ende gibt, weil dort die Essenz destilliert ist. Prüfe: Was ist das Problem, das alle Beispiele verbindet?",
        "pacing": "Pacing folgt der Regel: So schnell wie möglich, so langsam wie nötig. Schneide alles weg, bis der Clip gerade noch verständlich ist, dann füge einen Atemzug zurück. Die Geschwindigkeit sollte sich dringend anfühlen, aber nicht gehetzt. Test: Kann man beim ersten Hören folgen?",
        "structure": "Struktur ist Problem → Beweis → Implikation. Nicht chronologisch, sondern logisch-emotional. Der Hook stellt das Problem auf, der Body liefert den unbestreitbaren Beweis (Beispiel), das Ende lässt die Implikation im Raum stehen (hier: 'und dann...' = es geht weiter, es ist ein Muster). Diese Struktur funktioniert, weil sie wie ein Mini-Argument gebaut ist."
      }
    }
  ],
  "source": "pairs_config.json",
  "pairs_analyzed": 9,
  "analyzed_at": "2026-01-03T00:22:33.651570"
}